
INSERT INTO students (student_name) VALUES
	('Попова Виктория Арсентьевна'),
	('Чистяков Артур Данилович'),
	('Козлов Кирилл Матвеевич'),
	('Галкина Кристина Ивановна'),
	('Андреев Демьян Максимович'),
	('Карпова Виктория Леонидовна'),
	('Соколов Максим Григорьевич'),
	('Пугачев Алексей Львович'),
	('Филимонова Валентина Данииловна'),
	('Киселев Илья Александрович');

INSERT INTO companies (company_name, address) VALUES
	('Каскад', '141797, Тамбовская область, город Одинцово, ул. Славы, 35'),
	('Вега', '078902, Саратовская область, город Воскресенск, ул. Гоголя, 88'),
	('Сибирский трактъ', '062339, Тюменская область, город Кашира, шоссе Бухарестская, 33'),
	('Фонтанка', '291041, Омская область, город Озёры, бульвар Будапештсткая, 10'),
	('Орион', '984451, Тюменская область, город Люберцы, шоссе Домодедовская, 83');
	
INSERT INTO courses (company_id, date_of_start, duration, 
					 hours_per_day, course_name) VALUES
	('1', '2021-02-17', '1 MONTH', '1', 'Анализ данных'),
	('1', '2021-01-10', '10 DAY', '2', 'Введение в язык С'),
	('3', '2021-02-06', '1 MONTH', '1', 'Основы С++'),
	('5', '2021-03-01', '3 WEEK', '2', 'Теория игр ч.1'),
	('4', '2021-03-20', '5 DAY', '3', 'Основы статистики'),
	('5', '2020-09-01', '2 MONTH', '1', 'Язык программирования Python');

INSERT INTO teachers (teacher_name, company_id) VALUES
	('Назарова Елизавета Игоревна', '1'),
	('Петухов Сергей Александрович', '2'),
	('Комаров Демид Анатольевич', '1'),
	('Парфенов Аркадий Семёнович', '3'),
	('Иванов Семён Макарович', '5'),
	('Максимова Мария Александровна', '4');

INSERT INTO student_courses (student_id, course_id) VALUES
	('1', '3'),
	('2', '1'),
	('2', '5'),
	('3', '3'),
	('5', '4'),
	('5', '2'),
	('6', '4'),
	('5', '3'),
	('7', '4'),
	('8', '2'),
	('9', '5'),
	('7', '2'),
	('3', '1'),
	('7', '1');

INSERT INTO classes (course_id, teacher_id, date_and_time) VALUES
	('1', '1', '2021-02-17 17:00:00'),
	('1', '3', '2021-02-20 15:00:00'),
	('1', '1', '2021-02-28 17:00:00'),
	('1', '3', '2021-03-01 16:00:00'),
	('1', '1', '2021-03-05 17:00:00'),
	('2', '1', '2021-01-10 17:00:00'),
	('2', '1', '2021-01-15 18:00:00'),
	('2', '1', '2021-01-20 18:00:00'),
	('3', '4', '2021-02-06 18:00:00'),
	('3', '4', '2021-02-12 17:00:00'),
	('3', '4', '2021-02-18 17:00:00'),
	('3', '4', '2021-02-24 11:00:00'),
	('4', '5', '2021-03-01 09:00:00'),
	('4', '5', '2021-03-07 09:00:00'),
	('5', '6', '2021-03-20 14:00:00'),
	('5', '6', '2021-03-21 17:00:00'),
	('5', '6', '2021-03-22 19:00:00'),
	('5', '6', '2021-03-23 17:00:00'),
	('5', '6', '2021-03-24 18:00:00'),
	('6', '5', '2020-09-01 17:00:00'),
	('6', '5', '2020-09-11 18:00:00'),
	('6', '5', '2020-09-21 17:00:00');

